bench/disk/baremetal/disk_2.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      16085.46
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  62.83
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0002s
    total number of events:              160934

Latency (ms):
         min:                                    0.08
         avg:                                    0.12
         max:                                    3.86
         95th percentile:                        0.16
         sum:                                19928.06

Threads fairness:
    events (avg/stddev):           80467.0000/39.00
    execution time (avg/stddev):   9.9640/0.00