bench/disk/baremetal/disk_64.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      78995.89
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  308.58
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0009s
    total number of events:              790136

Latency (ms):
         min:                                    0.12
         avg:                                    0.81
         max:                                    5.37
         95th percentile:                        1.30
         sum:                               639458.51

Threads fairness:
    events (avg/stddev):           12345.8750/48.66
    execution time (avg/stddev):   9.9915/0.00